{
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 1,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ACCESSORY",
    "2": "I-ACCESSORY",
    "3": "B-ACCURACY",
    "4": "I-ACCURACY",
    "5": "B-ACTION",
    "6": "I-ACTION",
    "7": "B-AGE_GROUP",
    "8": "I-AGE_GROUP",
    "9": "B-AIRFLOW",
    "10": "I-AIRFLOW",
    "11": "B-ANIMAL",
    "12": "I-ANIMAL",
    "13": "B-ATTRIBUTE",
    "14": "I-ATTRIBUTE",
    "15": "B-AUDIO_FORMAT",
    "16": "I-AUDIO_FORMAT",
    "17": "B-BALANCE",
    "18": "I-BALANCE",
    "19": "B-BAND",
    "20": "I-BAND",
    "21": "B-BATTERY",
    "22": "I-BATTERY",
    "23": "B-BATTERY_LIFE",
    "24": "I-BATTERY_LIFE",
    "25": "B-BELT",
    "26": "I-BELT",
    "27": "B-BOILER",
    "28": "I-BOILER",
    "29": "B-BRAND",
    "30": "I-BRAND",
    "31": "B-BRAND_EXCLUSION",
    "32": "I-BRAND_EXCLUSION",
    "33": "B-BURR",
    "34": "I-BURR",
    "35": "B-CAPACITY",
    "36": "I-CAPACITY",
    "37": "B-CATEGORY",
    "38": "I-CATEGORY",
    "39": "B-CERTIFICATION",
    "40": "I-CERTIFICATION",
    "41": "B-CHANNELS",
    "42": "I-CHANNELS",
    "43": "B-CHIPSET",
    "44": "I-CHIPSET",
    "45": "B-COLOR",
    "46": "I-COLOR",
    "47": "B-COMPATIBILITY",
    "48": "I-COMPATIBILITY",
    "49": "B-COMPONENT",
    "50": "I-COMPONENT",
    "51": "B-CONDITION",
    "52": "I-CONDITION",
    "53": "B-CONNECTIVITY",
    "54": "I-CONNECTIVITY",
    "55": "B-CONSTRUCTION",
    "56": "I-CONSTRUCTION",
    "57": "B-CORES",
    "58": "I-CORES",
    "59": "B-COVERAGE",
    "60": "I-COVERAGE",
    "61": "B-CURVE",
    "62": "I-CURVE",
    "63": "B-DEPTH",
    "64": "I-DEPTH",
    "65": "B-DEPTH_RATING",
    "66": "I-DEPTH_RATING",
    "67": "B-DESIGN",
    "68": "I-DESIGN",
    "69": "B-DISPLAY",
    "70": "I-DISPLAY",
    "71": "B-DRAW_WEIGHT",
    "72": "I-DRAW_WEIGHT",
    "73": "B-DRIVE",
    "74": "I-DRIVE",
    "75": "B-DRIVER",
    "76": "I-DRIVER",
    "77": "B-EDITION",
    "78": "I-EDITION",
    "79": "B-EFFICIENCY",
    "80": "I-EFFICIENCY",
    "81": "B-ERA",
    "82": "I-ERA",
    "83": "B-FEATURE",
    "84": "I-FEATURE",
    "85": "B-FILL",
    "86": "I-FILL",
    "87": "B-FILTER",
    "88": "I-FILTER",
    "89": "B-FINISH",
    "90": "I-FINISH",
    "91": "B-FIN_SETUP",
    "92": "I-FIN_SETUP",
    "93": "B-FIRMNESS",
    "94": "I-FIRMNESS",
    "95": "B-FLEX",
    "96": "I-FLEX",
    "97": "B-FLIGHT_TIME",
    "98": "I-FLIGHT_TIME",
    "99": "B-FOCAL_LENGTH",
    "100": "I-FOCAL_LENGTH",
    "101": "B-FORM_FACTOR",
    "102": "I-FORM_FACTOR",
    "103": "B-FOV",
    "104": "I-FOV",
    "105": "B-FRAME",
    "106": "I-FRAME",
    "107": "B-FRAME_RATE",
    "108": "I-FRAME_RATE",
    "109": "B-FUEL",
    "110": "I-FUEL",
    "111": "B-GAUGE",
    "112": "I-GAUGE",
    "113": "B-GEAR_RATIO",
    "114": "I-GEAR_RATIO",
    "115": "B-GENDER",
    "116": "I-GENDER",
    "117": "B-GENERATION",
    "118": "I-GENERATION",
    "119": "B-GENRE",
    "120": "I-GENRE",
    "121": "B-GPU",
    "122": "I-GPU",
    "123": "B-GROUP",
    "124": "I-GROUP",
    "125": "B-HAND",
    "126": "I-HAND",
    "127": "B-HEAD_SIZE",
    "128": "I-HEAD_SIZE",
    "129": "B-HEIGHT",
    "130": "I-HEIGHT",
    "131": "B-ICE_TYPE",
    "132": "I-ICE_TYPE",
    "133": "B-INCLINE",
    "134": "I-INCLINE",
    "135": "B-INCLUSIONS",
    "136": "I-INCLUSIONS",
    "137": "B-INSULATION",
    "138": "I-INSULATION",
    "139": "B-KEYS",
    "140": "I-KEYS",
    "141": "B-LENGTH",
    "142": "I-LENGTH",
    "143": "B-LINE_WEIGHT",
    "144": "I-LINE_WEIGHT",
    "145": "B-MAGNIFICATION",
    "146": "I-MAGNIFICATION",
    "147": "B-MATERIAL",
    "148": "I-MATERIAL",
    "149": "B-MODEL",
    "150": "I-MODEL",
    "151": "B-MODEL_EXCLUSION",
    "152": "I-MODEL_EXCLUSION",
    "153": "B-MOTOR",
    "154": "I-MOTOR",
    "155": "B-MOUNT",
    "156": "I-MOUNT",
    "157": "B-MOVEMENT",
    "158": "I-MOVEMENT",
    "159": "B-ORIENTATION",
    "160": "I-ORIENTATION",
    "161": "B-ORIGIN",
    "162": "I-ORIGIN",
    "163": "B-OS",
    "164": "I-OS",
    "165": "B-OUTLETS",
    "166": "I-OUTLETS",
    "167": "B-PATTERN",
    "168": "I-PATTERN",
    "169": "B-PLACEMENT",
    "170": "I-PLACEMENT",
    "171": "B-PLATFORM",
    "172": "I-PLATFORM",
    "173": "B-PLAYER",
    "174": "I-PLAYER",
    "175": "B-POSITION",
    "176": "I-POSITION",
    "177": "B-POWER",
    "178": "I-POWER",
    "179": "B-PRICE_PREFERENCE",
    "180": "I-PRICE_PREFERENCE",
    "181": "B-PRICE_RANGE",
    "182": "I-PRICE_RANGE",
    "183": "B-PROCESSOR",
    "184": "I-PROCESSOR",
    "185": "B-PROCESSOR_GEN",
    "186": "I-PROCESSOR_GEN",
    "187": "B-PRODUCT_TYPE",
    "188": "I-PRODUCT_TYPE",
    "189": "B-PROPULSION",
    "190": "I-PROPULSION",
    "191": "B-PROTECTION",
    "192": "I-PROTECTION",
    "193": "B-PROTOCOL",
    "194": "I-PROTOCOL",
    "195": "B-QUANTITY",
    "196": "I-QUANTITY",
    "197": "B-RAM",
    "198": "I-RAM",
    "199": "B-RAM_TYPE",
    "200": "I-RAM_TYPE",
    "201": "B-RANGE",
    "202": "I-RANGE",
    "203": "B-RATING",
    "204": "I-RATING",
    "205": "B-REFRESH_RATE",
    "206": "I-REFRESH_RATE",
    "207": "B-RESISTANCE",
    "208": "I-RESISTANCE",
    "209": "B-RESOLUTION",
    "210": "I-RESOLUTION",
    "211": "B-RESPONSE_TIME",
    "212": "I-RESPONSE_TIME",
    "213": "B-ROCKER",
    "214": "I-ROCKER",
    "215": "B-SEASON",
    "216": "I-SEASON",
    "217": "B-SENSOR",
    "218": "I-SENSOR",
    "219": "B-SERIES",
    "220": "I-SERIES",
    "221": "B-SET",
    "222": "I-SET",
    "223": "B-SHAPE",
    "224": "I-SHAPE",
    "225": "B-SIMILAR_TO",
    "226": "I-SIMILAR_TO",
    "227": "B-SIZE",
    "228": "I-SIZE",
    "229": "B-SKILL_LEVEL",
    "230": "I-SKILL_LEVEL",
    "231": "B-SLOTS",
    "232": "I-SLOTS",
    "233": "B-SOCKET",
    "234": "I-SOCKET",
    "235": "B-SPECIES",
    "236": "I-SPECIES",
    "237": "B-SPECIFIC_PRODUCT",
    "238": "I-SPECIFIC_PRODUCT",
    "239": "B-SPECTRUM",
    "240": "I-SPECTRUM",
    "241": "B-SPEED",
    "242": "I-SPEED",
    "243": "B-STAGES",
    "244": "I-STAGES",
    "245": "B-STORAGE",
    "246": "I-STORAGE",
    "247": "B-STRIDE",
    "248": "I-STRIDE",
    "249": "B-STRING_PATTERN",
    "250": "I-STRING_PATTERN",
    "251": "B-STYLE",
    "252": "I-STYLE",
    "253": "B-SUBSCRIPTION",
    "254": "I-SUBSCRIPTION",
    "255": "B-SURFACE",
    "256": "I-SURFACE",
    "257": "B-SUSPENSION",
    "258": "I-SUSPENSION",
    "259": "B-SWITCH_TYPE",
    "260": "I-SWITCH_TYPE",
    "261": "B-TECH",
    "262": "I-TECH",
    "263": "B-TEMP_RATING",
    "264": "I-TEMP_RATING",
    "265": "B-THICKNESS",
    "266": "I-THICKNESS",
    "267": "B-THRUST",
    "268": "I-THRUST",
    "269": "B-TIER",
    "270": "I-TIER",
    "271": "B-TIP_SIZE",
    "272": "I-TIP_SIZE",
    "273": "B-TRAVEL",
    "274": "I-TRAVEL",
    "275": "B-USAGE",
    "276": "I-USAGE",
    "277": "B-VARIANT",
    "278": "I-VARIANT",
    "279": "B-VOLTAGE",
    "280": "I-VOLTAGE",
    "281": "B-VRAM",
    "282": "I-VRAM",
    "283": "B-WARRANTY",
    "284": "I-WARRANTY",
    "285": "B-WEIGHT",
    "286": "I-WEIGHT",
    "287": "B-WEIGHT_RANGE",
    "288": "I-WEIGHT_RANGE",
    "289": "B-WHEEL_SIZE",
    "290": "I-WHEEL_SIZE",
    "291": "B-WIDTH",
    "292": "I-WIDTH",
    "293": "B-YEAR",
    "294": "I-YEAR"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCESSORY": 1,
    "B-ACCURACY": 3,
    "B-ACTION": 5,
    "B-AGE_GROUP": 7,
    "B-AIRFLOW": 9,
    "B-ANIMAL": 11,
    "B-ATTRIBUTE": 13,
    "B-AUDIO_FORMAT": 15,
    "B-BALANCE": 17,
    "B-BAND": 19,
    "B-BATTERY": 21,
    "B-BATTERY_LIFE": 23,
    "B-BELT": 25,
    "B-BOILER": 27,
    "B-BRAND": 29,
    "B-BRAND_EXCLUSION": 31,
    "B-BURR": 33,
    "B-CAPACITY": 35,
    "B-CATEGORY": 37,
    "B-CERTIFICATION": 39,
    "B-CHANNELS": 41,
    "B-CHIPSET": 43,
    "B-COLOR": 45,
    "B-COMPATIBILITY": 47,
    "B-COMPONENT": 49,
    "B-CONDITION": 51,
    "B-CONNECTIVITY": 53,
    "B-CONSTRUCTION": 55,
    "B-CORES": 57,
    "B-COVERAGE": 59,
    "B-CURVE": 61,
    "B-DEPTH": 63,
    "B-DEPTH_RATING": 65,
    "B-DESIGN": 67,
    "B-DISPLAY": 69,
    "B-DRAW_WEIGHT": 71,
    "B-DRIVE": 73,
    "B-DRIVER": 75,
    "B-EDITION": 77,
    "B-EFFICIENCY": 79,
    "B-ERA": 81,
    "B-FEATURE": 83,
    "B-FILL": 85,
    "B-FILTER": 87,
    "B-FINISH": 89,
    "B-FIN_SETUP": 91,
    "B-FIRMNESS": 93,
    "B-FLEX": 95,
    "B-FLIGHT_TIME": 97,
    "B-FOCAL_LENGTH": 99,
    "B-FORM_FACTOR": 101,
    "B-FOV": 103,
    "B-FRAME": 105,
    "B-FRAME_RATE": 107,
    "B-FUEL": 109,
    "B-GAUGE": 111,
    "B-GEAR_RATIO": 113,
    "B-GENDER": 115,
    "B-GENERATION": 117,
    "B-GENRE": 119,
    "B-GPU": 121,
    "B-GROUP": 123,
    "B-HAND": 125,
    "B-HEAD_SIZE": 127,
    "B-HEIGHT": 129,
    "B-ICE_TYPE": 131,
    "B-INCLINE": 133,
    "B-INCLUSIONS": 135,
    "B-INSULATION": 137,
    "B-KEYS": 139,
    "B-LENGTH": 141,
    "B-LINE_WEIGHT": 143,
    "B-MAGNIFICATION": 145,
    "B-MATERIAL": 147,
    "B-MODEL": 149,
    "B-MODEL_EXCLUSION": 151,
    "B-MOTOR": 153,
    "B-MOUNT": 155,
    "B-MOVEMENT": 157,
    "B-ORIENTATION": 159,
    "B-ORIGIN": 161,
    "B-OS": 163,
    "B-OUTLETS": 165,
    "B-PATTERN": 167,
    "B-PLACEMENT": 169,
    "B-PLATFORM": 171,
    "B-PLAYER": 173,
    "B-POSITION": 175,
    "B-POWER": 177,
    "B-PRICE_PREFERENCE": 179,
    "B-PRICE_RANGE": 181,
    "B-PROCESSOR": 183,
    "B-PROCESSOR_GEN": 185,
    "B-PRODUCT_TYPE": 187,
    "B-PROPULSION": 189,
    "B-PROTECTION": 191,
    "B-PROTOCOL": 193,
    "B-QUANTITY": 195,
    "B-RAM": 197,
    "B-RAM_TYPE": 199,
    "B-RANGE": 201,
    "B-RATING": 203,
    "B-REFRESH_RATE": 205,
    "B-RESISTANCE": 207,
    "B-RESOLUTION": 209,
    "B-RESPONSE_TIME": 211,
    "B-ROCKER": 213,
    "B-SEASON": 215,
    "B-SENSOR": 217,
    "B-SERIES": 219,
    "B-SET": 221,
    "B-SHAPE": 223,
    "B-SIMILAR_TO": 225,
    "B-SIZE": 227,
    "B-SKILL_LEVEL": 229,
    "B-SLOTS": 231,
    "B-SOCKET": 233,
    "B-SPECIES": 235,
    "B-SPECIFIC_PRODUCT": 237,
    "B-SPECTRUM": 239,
    "B-SPEED": 241,
    "B-STAGES": 243,
    "B-STORAGE": 245,
    "B-STRIDE": 247,
    "B-STRING_PATTERN": 249,
    "B-STYLE": 251,
    "B-SUBSCRIPTION": 253,
    "B-SURFACE": 255,
    "B-SUSPENSION": 257,
    "B-SWITCH_TYPE": 259,
    "B-TECH": 261,
    "B-TEMP_RATING": 263,
    "B-THICKNESS": 265,
    "B-THRUST": 267,
    "B-TIER": 269,
    "B-TIP_SIZE": 271,
    "B-TRAVEL": 273,
    "B-USAGE": 275,
    "B-VARIANT": 277,
    "B-VOLTAGE": 279,
    "B-VRAM": 281,
    "B-WARRANTY": 283,
    "B-WEIGHT": 285,
    "B-WEIGHT_RANGE": 287,
    "B-WHEEL_SIZE": 289,
    "B-WIDTH": 291,
    "B-YEAR": 293,
    "I-ACCESSORY": 2,
    "I-ACCURACY": 4,
    "I-ACTION": 6,
    "I-AGE_GROUP": 8,
    "I-AIRFLOW": 10,
    "I-ANIMAL": 12,
    "I-ATTRIBUTE": 14,
    "I-AUDIO_FORMAT": 16,
    "I-BALANCE": 18,
    "I-BAND": 20,
    "I-BATTERY": 22,
    "I-BATTERY_LIFE": 24,
    "I-BELT": 26,
    "I-BOILER": 28,
    "I-BRAND": 30,
    "I-BRAND_EXCLUSION": 32,
    "I-BURR": 34,
    "I-CAPACITY": 36,
    "I-CATEGORY": 38,
    "I-CERTIFICATION": 40,
    "I-CHANNELS": 42,
    "I-CHIPSET": 44,
    "I-COLOR": 46,
    "I-COMPATIBILITY": 48,
    "I-COMPONENT": 50,
    "I-CONDITION": 52,
    "I-CONNECTIVITY": 54,
    "I-CONSTRUCTION": 56,
    "I-CORES": 58,
    "I-COVERAGE": 60,
    "I-CURVE": 62,
    "I-DEPTH": 64,
    "I-DEPTH_RATING": 66,
    "I-DESIGN": 68,
    "I-DISPLAY": 70,
    "I-DRAW_WEIGHT": 72,
    "I-DRIVE": 74,
    "I-DRIVER": 76,
    "I-EDITION": 78,
    "I-EFFICIENCY": 80,
    "I-ERA": 82,
    "I-FEATURE": 84,
    "I-FILL": 86,
    "I-FILTER": 88,
    "I-FINISH": 90,
    "I-FIN_SETUP": 92,
    "I-FIRMNESS": 94,
    "I-FLEX": 96,
    "I-FLIGHT_TIME": 98,
    "I-FOCAL_LENGTH": 100,
    "I-FORM_FACTOR": 102,
    "I-FOV": 104,
    "I-FRAME": 106,
    "I-FRAME_RATE": 108,
    "I-FUEL": 110,
    "I-GAUGE": 112,
    "I-GEAR_RATIO": 114,
    "I-GENDER": 116,
    "I-GENERATION": 118,
    "I-GENRE": 120,
    "I-GPU": 122,
    "I-GROUP": 124,
    "I-HAND": 126,
    "I-HEAD_SIZE": 128,
    "I-HEIGHT": 130,
    "I-ICE_TYPE": 132,
    "I-INCLINE": 134,
    "I-INCLUSIONS": 136,
    "I-INSULATION": 138,
    "I-KEYS": 140,
    "I-LENGTH": 142,
    "I-LINE_WEIGHT": 144,
    "I-MAGNIFICATION": 146,
    "I-MATERIAL": 148,
    "I-MODEL": 150,
    "I-MODEL_EXCLUSION": 152,
    "I-MOTOR": 154,
    "I-MOUNT": 156,
    "I-MOVEMENT": 158,
    "I-ORIENTATION": 160,
    "I-ORIGIN": 162,
    "I-OS": 164,
    "I-OUTLETS": 166,
    "I-PATTERN": 168,
    "I-PLACEMENT": 170,
    "I-PLATFORM": 172,
    "I-PLAYER": 174,
    "I-POSITION": 176,
    "I-POWER": 178,
    "I-PRICE_PREFERENCE": 180,
    "I-PRICE_RANGE": 182,
    "I-PROCESSOR": 184,
    "I-PROCESSOR_GEN": 186,
    "I-PRODUCT_TYPE": 188,
    "I-PROPULSION": 190,
    "I-PROTECTION": 192,
    "I-PROTOCOL": 194,
    "I-QUANTITY": 196,
    "I-RAM": 198,
    "I-RAM_TYPE": 200,
    "I-RANGE": 202,
    "I-RATING": 204,
    "I-REFRESH_RATE": 206,
    "I-RESISTANCE": 208,
    "I-RESOLUTION": 210,
    "I-RESPONSE_TIME": 212,
    "I-ROCKER": 214,
    "I-SEASON": 216,
    "I-SENSOR": 218,
    "I-SERIES": 220,
    "I-SET": 222,
    "I-SHAPE": 224,
    "I-SIMILAR_TO": 226,
    "I-SIZE": 228,
    "I-SKILL_LEVEL": 230,
    "I-SLOTS": 232,
    "I-SOCKET": 234,
    "I-SPECIES": 236,
    "I-SPECIFIC_PRODUCT": 238,
    "I-SPECTRUM": 240,
    "I-SPEED": 242,
    "I-STAGES": 244,
    "I-STORAGE": 246,
    "I-STRIDE": 248,
    "I-STRING_PATTERN": 250,
    "I-STYLE": 252,
    "I-SUBSCRIPTION": 254,
    "I-SURFACE": 256,
    "I-SUSPENSION": 258,
    "I-SWITCH_TYPE": 260,
    "I-TECH": 262,
    "I-TEMP_RATING": 264,
    "I-THICKNESS": 266,
    "I-THRUST": 268,
    "I-TIER": 270,
    "I-TIP_SIZE": 272,
    "I-TRAVEL": 274,
    "I-USAGE": 276,
    "I-VARIANT": 278,
    "I-VOLTAGE": 280,
    "I-VRAM": 282,
    "I-WARRANTY": 284,
    "I-WEIGHT": 286,
    "I-WEIGHT_RANGE": 288,
    "I-WHEEL_SIZE": 290,
    "I-WIDTH": 292,
    "I-YEAR": 294,
    "O": 0
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.57.3",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
